In [1]:
import pandas as pd
import numpy as np

In [2]:
train_data = pd.read_csv("./train.csv")
train_data.head()
# train_data.shape

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train_data.shape

(891, 12)

In [4]:
test_data = pd.read_csv("./test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
test_data.shape

(418, 11)

In [6]:
women = train_data.loc[train_data.Sex == "female"]["Survived"]
rate_survived = sum(women)/len(women)

print(rate_survived*100)

74.20382165605095

In [7]:
men = train_data.loc[train_data.Sex == "male"]["Survived"]
rate_survived = sum(men)/len(men)

print(rate_survived*100)

18.890814558058924

In [8]:
mean_age = train_data["Age"].mean()
train_data["Age"].fillna(mean_age, inplace=True)

In [9]:
train_data["Age"] = train_data["Age"].astype(int)

In [10]:
mean_age_test = test_data["Age"].mean()
test_data["Age"].fillna(mean_age_test, inplace=True)

In [11]:
test_data["Age"] = test_data["Age"].astype(int)

In [12]:
mean_fare_test = test_data["Fare"].mean()
test_data["Fare"].fillna(mean_age_test, inplace=True)

In [13]:
test_data["Fare"] = test_data["Fare"].astype(int)

In [14]:
from sklearn.ensemble import RandomForestClassifier

y = train_data["Survived"]
features = ["Sex", "Pclass", "SibSp", "Parch", "Fare", "Age"]
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])

model = RandomForestClassifier(n_estimators=100, max_depth=18, random_state=42)
model.fit(X, y)
model.score(X,y)

0.9764309764309764

In [15]:
predictions = model.predict(X_test)

output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('submission.csv', index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!

In [16]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34,0,0,330911,7,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27,0,0,315154,8,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12,NaN,S